* Tasks
:PROPERTIES:
:CATEGORY:
:END:

** CANCELED 了解微信公众平台
CLOSED: [2019-07-09 周二 09:13] SCHEDULED: <2019-07-03 周三>
- State "CANCELED"   from "HOLD"       [2019-07-09 周二 09:13]
- State "HOLD"       from "TODO"       [2019-07-05 Fri 20:09]
:LOGBOOK:
CLOCK: [2019-07-03 周三 10:09]--[2019-07-03 周三 11:07] =>  0:58
CLOCK: [2019-07-03 周三 10:04]--[2019-07-03 周三 10:06] =>  0:02
:END:

- 资源 :: [[https://mp.weixin.qq.com/wiki?t=resource/res_main&id=mp1445241432][微信公众平台技术文档]]
- 笔记 :: [[][我的整理]
        
** TODO Learn FreeBSD basic setup [33%]
SCHEDULED: <2019-07-05 Fri>
:LOGBOOK:
CLOCK: [2019-07-06 Sat 15:59]--[2019-07-06 Sat 16:01] =>  0:02
CLOCK: [2019-07-06 Sat 15:54]--[2019-07-06 Sat 15:55] =>  0:01
CLOCK: [2019-07-06 Sat 12:00]--[2019-07-06 Sat 12:01] =>  0:01
CLOCK: [2019-07-06 Sat 11:51]--[2019-07-06 Sat 12:00] =>  0:09
CLOCK: [2019-07-05 Fri 20:38]--[2019-07-06 Sat 00:59] =>  4:21
:END:

- [X] Read [[https://www.freebsd.org/doc/en_US.ISO8859-1/articles/linux-users/index.html][FreeBSD Quickstart Guide for Linux® Users]]
- [ ] Read [[https://www.freebsd.org/doc/handbook/index.html][FreeBSD Handbook]]
- [ ] [[file:~/Books/Operating_System/Absolute%20FreeBSD%20The%20Complete%20Guide%20to%20FreeBSD,%203rd%20Edition.epub][Absolute FreeBSD]]

** TODO Learn Haskell [0%]
DEADLINE: <2019-09-09 周一> SCHEDULED: <2019-07-08 周一>
:LOGBOOK:
CLOCK: [2019-07-09 周二 15:12]--[2019-07-09 周二 15:40] =>  0:28
CLOCK: [2019-07-09 周二 09:08]--[2019-07-09 周二 09:18] =>  0:10
CLOCK: [2019-07-08 周一 09:10]--[2019-07-08 周一 09:47] =>  0:37
:END:

*** Initial steps [75%]

- [X] Install Haskell on Windows
- [X] Install Haskell on MacOS
- [ ] Install Haskell on FreeBSD
- [X] Read /Haskell Programming from First Principles/ - /Chap.1 All You Need is Lambda/

** Read Haskell [[https://en.wikibooks.org/wiki/Haskell][WikiBook]]

** TODO Study /Haskell Programming from First Principles/ [33%]
SCHEDULED: <2019-07-10 周三>
- [X] [[*Chap.1 All you need is Lambda][Chap.1 All you need is Lambda]]
- [X] [[*Chap.2 Hello, Haskell][Chap.2 Hello, Haskell]]
- [ ] [[*Chap.3 Strings][Chap.3 Strings]]
- [ ] [[*Chap.4 Basic datatypes][Chap.4 Basic datatypes]]
- [ ] [[*Chap.5 Types][Chap.5 Types]]
- [ ] [[*Chap.6 Typeclasses][Chap.6 Typeclasses]]

*** DONE Chap.1 All you need is Lambda
CLOSED: [2019-07-10 周三 11:31]
*** TODO Chap.2There are times when you want to refer to an infix function
without applying any arguments, and there are also times
when you want to use them as prefix operators instead of infix.
In both cases you must wrap the operator in parentheses. Hello, Haskell
SCHEDULED: <2019-07-10 周三>
:LOGBOOK:
CLOCK: [2019-07-10 周三 15:18]--[2019-07-10 周三 16:22] =>  1:04
CLOCK: [2019-07-10 周三 14:25]--[2019-07-10 周三 15:00] =>  0:35
CLOCK: [2019-07-10 周三 11:43]--[2019-07-10 周三 11:43] =>  0:00
CLOCK: [2019-07-10 周三 11:38]--[2019-07-10 周三 11:43] =>  0:05
:END:
*** TODO Chap.3 Strings
*** TODO Chap.4 Basic datatypes
DEADLINE: <2019-07-11 周四>
*** Chap.5 Types
*** Chap.6 Typeclasses
